; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	instrument2 - instrument
	instrument3 - instrument
	satellite2 - satellite
	instrument4 - instrument
	satellite3 - satellite
	instrument5 - instrument
	instrument6 - instrument
	satellite4 - satellite
	instrument7 - instrument
	spectrograph0 - mode
	thermograph2 - mode
	spectrograph1 - mode
	Star0 - direction
	GroundStation4 - direction
	GroundStation2 - direction
	Star3 - direction
	GroundStation1 - direction
	Star5 - direction
	Planet6 - direction
	Phenomenon7 - direction
	Phenomenon8 - direction
	Star9 - direction
	Star10 - direction
	Phenomenon11 - direction
	Phenomenon12 - direction
	Planet13 - direction
)
(:init
	(supports instrument0 spectrograph0)
	(calibration_target instrument0 GroundStation1)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation4)
	(supports instrument1 spectrograph0)
	(supports instrument1 spectrograph1)
	(supports instrument1 thermograph2)
	(calibration_target instrument1 GroundStation1)
	(supports instrument2 spectrograph0)
	(supports instrument2 spectrograph1)
	(supports instrument2 thermograph2)
	(calibration_target instrument2 GroundStation1)
	(supports instrument3 spectrograph0)
	(supports instrument3 spectrograph1)
	(supports instrument3 thermograph2)
	(calibration_target instrument3 GroundStation4)
	(on_board instrument1 satellite1)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Phenomenon8)
	(supports instrument4 spectrograph1)
	(supports instrument4 spectrograph0)
	(supports instrument4 thermograph2)
	(calibration_target instrument4 GroundStation2)
	(on_board instrument4 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star5)
	(supports instrument5 spectrograph1)
	(supports instrument5 spectrograph0)
	(supports instrument5 thermograph2)
	(calibration_target instrument5 Star3)
	(supports instrument6 thermograph2)
	(calibration_target instrument6 Star3)
	(on_board instrument5 satellite3)
	(on_board instrument6 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Planet6)
	(supports instrument7 spectrograph1)
	(supports instrument7 spectrograph0)
	(supports instrument7 thermograph2)
	(calibration_target instrument7 GroundStation1)
	(on_board instrument7 satellite4)
	(power_avail satellite4)
	(pointing satellite4 Star5)
)
(:goal (and
	(pointing satellite0 Phenomenon12)
	(pointing satellite1 Phenomenon12)
	(pointing satellite4 Phenomenon12)
	(have_image Star5 spectrograph0)
	(have_image Planet6 thermograph2)
	(have_image Phenomenon7 spectrograph1)
	(have_image Phenomenon8 spectrograph1)
	(have_image Star9 spectrograph0)
	(have_image Star10 thermograph2)
	(have_image Phenomenon11 spectrograph0)
	(have_image Phenomenon12 thermograph2)
	(have_image Planet13 spectrograph1)
))

)

; plan
1. (turn_to satellite4 phenomenon12 star5)
   deleted: (pointing satellite4 star5)
   added: (pointing satellite4 phenomenon12)
   goals met: 1 of 12
2. (turn_to satellite1 groundstation1 phenomenon8)
   deleted: (pointing satellite1 phenomenon8)
   added: (pointing satellite1 groundstation1)
   goals met: 1 of 12
3. (switch_on instrument1 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument1)
   goals met: 1 of 12
4. (calibrate satellite1 instrument1 groundstation1)
   added: (calibrated instrument1)
   goals met: 1 of 12
5. (turn_to satellite1 planet13 groundstation1)
   deleted: (pointing satellite1 groundstation1)
   added: (pointing satellite1 planet13)
   goals met: 1 of 12
6. (take_image satellite1 planet13 instrument1 spectrograph1)
   added: (have_image planet13 spectrograph1)
   goals met: 2 of 12
7. (turn_to satellite1 phenomenon8 planet13)
   deleted: (pointing satellite1 planet13)
   added: (pointing satellite1 phenomenon8)
   goals met: 2 of 12
8. (take_image satellite1 phenomenon8 instrument1 spectrograph1)
   added: (have_image phenomenon8 spectrograph1)
   goals met: 3 of 12
9. (turn_to satellite1 phenomenon7 phenomenon8)
   deleted: (pointing satellite1 phenomenon8)
   added: (pointing satellite1 phenomenon7)
   goals met: 3 of 12
10. (take_image satellite1 phenomenon7 instrument1 spectrograph1)
   added: (have_image phenomenon7 spectrograph1)
   goals met: 4 of 12
11. (turn_to satellite1 phenomenon11 phenomenon7)
   deleted: (pointing satellite1 phenomenon7)
   added: (pointing satellite1 phenomenon11)
   goals met: 4 of 12
12. (turn_to satellite0 phenomenon12 groundstation4)
   deleted: (pointing satellite0 groundstation4)
   added: (pointing satellite0 phenomenon12)
   goals met: 5 of 12
13. (take_image satellite1 phenomenon11 instrument1 spectrograph0)
   added: (have_image phenomenon11 spectrograph0)
   goals met: 6 of 12
14. (turn_to satellite1 planet6 phenomenon11)
   deleted: (pointing satellite1 phenomenon11)
   added: (pointing satellite1 planet6)
   goals met: 6 of 12
15. (take_image satellite1 planet6 instrument1 thermograph2)
   added: (have_image planet6 thermograph2)
   goals met: 7 of 12
16. (turn_to satellite1 star10 planet6)
   deleted: (pointing satellite1 planet6)
   added: (pointing satellite1 star10)
   goals met: 7 of 12
17. (take_image satellite1 star10 instrument1 thermograph2)
   added: (have_image star10 thermograph2)
   goals met: 8 of 12
18. (turn_to satellite1 star5 star10)
   deleted: (pointing satellite1 star10)
   added: (pointing satellite1 star5)
   goals met: 8 of 12
19. (take_image satellite1 star5 instrument1 spectrograph0)
   added: (have_image star5 spectrograph0)
   goals met: 9 of 12
20. (turn_to satellite1 star9 star5)
   deleted: (pointing satellite1 star5)
   added: (pointing satellite1 star9)
   goals met: 9 of 12
21. (take_image satellite1 star9 instrument1 spectrograph0)
   added: (have_image star9 spectrograph0)
   goals met: 10 of 12
22. (turn_to satellite1 phenomenon12 star9)
   deleted: (pointing satellite1 star9)
   added: (pointing satellite1 phenomenon12)
   goals met: 11 of 12
23. (take_image satellite1 phenomenon12 instrument1 thermograph2)
   added: (have_image phenomenon12 thermograph2)
   goals met: 12 of 12
